In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [4]:
dates = ['2022-07-19','2022-07-20','2022-07-21','2022-07-22','2022-07-23']
score = Series([1000, 14000, 3000, 3000, 1000],index=dates)
print(score)
print("자료형 확인 : ",type(score))

2022-07-19     1000
2022-07-20    14000
2022-07-21     3000
2022-07-22     3000
2022-07-23     1000
dtype: int64
자료형 확인 :  <class 'pandas.core.series.Series'>

In [5]:
score.index

Index(['2022-07-19', '2022-07-20', '2022-07-21', '2022-07-22', '2022-07-23'], dtype='object')

In [6]:
score.values

array([ 1000, 14000,  3000,  3000,  1000], dtype=int64)

In [7]:
dict_dat = { 'one':[10,20,30,40],
             'two':[100,200,300,400],
             'three':[1000,2000,3000,4000]}

date = ['2022-05-01', '2022-05-02', '2022-05-03', '2022-05-05']
df = pd.DataFrame(dict_dat, index=date)
df

            one  two  three
2022-05-01   10  100   1000
2022-05-02   20  200   2000
2022-05-03   30  300   3000
2022-05-05   40  400   4000

In [10]:
team_score = { "toto":[1500,3000,5000,7000,5500],
               "apple":[4000,5000,6000,5500,4500],
               "gildong":[2000,2500,3000,4000,3000],
               "catanddog":[7000,5000,3000,5000,4000]}

team_df = DataFrame(team_score)
team_df.insert(4,"aa",[200,20,20,50,40])
team_df

   toto  apple  gildong  catanddog   aa
0  1500   4000     2000       7000  200
1  3000   5000     2500       5000   20
2  5000   6000     3000       3000   20
3  7000   5500     4000       5000   50
4  5500   4500     3000       4000   40

In [14]:
tmp_sum = team_df.sum(axis=1)

In [15]:
team_df['Sum'] = tmp_sum
team_df

   toto  apple  gildong  catanddog   aa    Sum
0  1500   4000     2000       7000  200  14700
1  3000   5000     2500       5000   20  15520
2  5000   6000     3000       3000   20  17020
3  7000   5500     4000       5000   50  21550
4  5500   4500     3000       4000   40  17040

In [17]:
tmp_mean = team_df.mean(axis=1)

In [18]:
team_df['Mean'] = tmp_mean
team_df

   toto  apple  gildong  catanddog   aa    Sum         Mean
0  1500   4000     2000       7000  200  14700  4900.000000
1  3000   5000     2500       5000   20  15520  5173.333333
2  5000   6000     3000       3000   20  17020  5673.333333
3  7000   5500     4000       5000   50  21550  7183.333333
4  5500   4500     3000       4000   40  17040  5680.000000

In [27]:
team_df.columns

Index(['toto', 'apple', 'gildong', 'catanddog', 'aa', 'Sum', 'Mean', 'len'], dtype='object')

In [30]:
col=['toto', 'apple', 'gildong', 'catanddog', 'aa']
team_df['len']=team_df[col].count(axis=1)
team_df

   toto  apple  gildong  catanddog   aa    Sum         Mean  len
0  1500   4000     2000       7000  200  14700  4900.000000    5
1  3000   5000     2500       5000   20  15520  5173.333333    5
2  5000   6000     3000       3000   20  17020  5673.333333    5
3  7000   5500     4000       5000   50  21550  7183.333333    5
4  5500   4500     3000       4000   40  17040  5680.000000    5

In [31]:
team_df.iloc[ : , 0: :2 ]

   toto  gildong   aa         Mean
0  1500     2000  200  4900.000000
1  3000     2500   20  5173.333333
2  5000     3000   20  5673.333333
3  7000     4000   50  7183.333333
4  5500     3000   40  5680.000000